<h1> LETS LEARN PANDAS</h1>

In [16]:
import pandas as pd,numpy as np  #importing on same line
#making dummy datas
a=np.random.randint(1,10,5)
a

array([1, 1, 3, 5, 6])

In [17]:

b=('a-b-c-d-e').split('-')
b

['a', 'b', 'c', 'd', 'e']

<h3>1d pandas</h3>

In [18]:
pd.Series(a)

0    1
1    1
2    3
3    5
4    6
dtype: int64

In [19]:
pd.Series(data=a) #taking datas from variable a

0    1
1    1
2    3
3    5
4    6
dtype: int64

In [21]:
pd.Series(data=a,index=b) #taking index from b

a    1
b    1
c    3
d    5
e    6
dtype: int64

lets start 2D ok guys

<h1>#DATAFRAMES<h1>

lets try with numbers

In [35]:
a=np.random.randint(1,20,(5,3))
a

array([[11,  4, 19],
       [ 1,  6, 18],
       [19, 14,  7],
       [ 3,  9,  2],
       [ 3,  4,  6]])

In [43]:
df=pd.DataFrame(a)
df

    0   1   2
0  11   4  19
1   1   6  18
2  19  14   7
3   3   9   2
4   3   4   6

In [41]:
df.describe()   #shows min,avg and max as well as others in table

               0          1          2
count   5.000000   5.000000   5.000000
mean    7.400000   7.400000  10.400000
std     7.536577   4.219005   7.635444
min     1.000000   4.000000   2.000000
25%     3.000000   4.000000   6.000000
50%     3.000000   6.000000   7.000000
75%    11.000000   9.000000  18.000000
max    19.000000  14.000000  19.000000

In [47]:
df.max(axis=1)   #axis=0 means horizontal and 1 vertical
df.max(axis=0)

0    19
1    14
2    19
dtype: int64

In [58]:
#making dummy datas for 2d pandas
a={'animal':['cat','dog','pandas','snake'],
  'cost':[100,200,300,350],
  'country':['japan','china','america','denmark']}
pd.Series(a)

animal            [cat, dog, pandas, snake]
cost                   [100, 200, 300, 350]
country    [japan, china, america, denmark]
dtype: object

In [60]:
df=pd.DataFrame(a)
df

   animal  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3   snake   350  denmark

In [83]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
df.shape

(4, 3)

In [85]:
df.columns

Index(['animal', 'cost', 'country'], dtype='object')

In [86]:
df[['animal','cost']] #if you dont want country in ur list

   animal  cost
0     cat   100
1     dog   200
2  pandas   300
3   snake   350

In [63]:
df.head(2) #only shows above 2 list

  animal  cost country
0    cat   100   japan
1    dog   200   china

In [80]:
df.tail(2) #only shows below 2 list

   animal  cost  country
2  pandas   300  america
3   snake   350  denmark

In [89]:
df[df.cost==df.cost.max()] #checks the animal with highest cost

  animal  cost  country
3  snake   350  denmark

In [91]:
#if we wanna change snake name to python
df.replace('snake','python')

   animal  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3  python   350  denmark

In [104]:
df.rename(columns={'animal':'pets'}) #chaning the title or column of the table

     pets  cost  country
0     cat   100    japan
1     dog   200    china
2  pandas   300  america
3   snake   350  denmark

<h3>It is boolean classifier (powerful) which classifies data is present in table or not</h3>

In [111]:
 df.cost==100

0     True
1    False
2    False
3    False
Name: cost, dtype: bool

<h4>When inside df[] dataframe is also shown</h4>

In [112]:
df[ df.cost==100 ]

  animal  cost country
0    cat   100   japan

In [ ]:
df[df.country=='japan'] #searching with country name